# Chi Square Test

In [1]:
#It is used for calculation of 2 catagorical columns**<- chi square
#Correlation is used for relation between 2 numerical columns

In [2]:
#NULL HYPOTHESIS->  We assume that the columns are independent

In [4]:
import pandas as pd
import numpy as np
import scipy.stats as stats
import seaborn as sns

In [6]:
dataset=sns.load_dataset('tips')

In [7]:
dataset

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [11]:
dataset_table=pd.crosstab(dataset.sex,dataset.smoker)

In [12]:
dataset_table #we cannot use this as this is a dataframe, we need a Array so we used data.values beneath

smoker  Yes  No
sex
Male     60  97
Female   33  54

In [14]:
#Observed Values
Observed_values=dataset_table.values

In [18]:
stats.chi2_contingency(Observed_values)# second value is P value,3rd value is degree of freedom,expected values
#important value is second

(0.0,
 1.0,
 1,
 array([[59.84016393, 97.15983607],
        [33.15983607, 53.84016393]]))

In [ ]:
# since the value is greater than 0.05 we are accepting null hypothesis i.e there is no correlation